# ScheduleTypeId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeSegment..::..ScheduleTypeId Property
PipeSegment Class See Also
---
The ElementId of the PipeScheduleType.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId ScheduleTypeId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ScheduleTypeId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ScheduleTypeId {
	ElementId^ get ();
}
```

# See Also
PipeSegment Class
Autodesk.Revit.DB.Plumbing Namespace